# todo: Шифр Цезаря
# Описание шифра.
# В криптографии шифр Цезаря, также известный шифр сдвига, код Цезаря или сдвиг Цезаря,
# является одним из самых простых и широко известных методов шифрования.
# Это тип подстановочного шифра, в котором каждая буква в открытом тексте заменяется буквой на некоторое
# фиксированное количество позиций вниз по алфавиту. Например, со сдвигом влево 3, D будет заменен на A,
# E станет Б, и так далее. Метод назван в честь Юлия Цезаря, который использовал его в своей частной переписке.

# Задача.
# Считайте файл message.txt и зашифруйте  текст шифром Цезаря, при этом символы первой строки файла должны
# циклически сдвигаться влево на 1, второй строки — на 2, третьей строки — на три и т.д.
# В этой задаче удобно считывать файл построчно, шифруя каждую строку в отдельности.
# В каждой строчке содержатся различные символы. Шифровать нужно только буквы кириллицы.


# 1. Сгенерировать текст для обработки
text = [
        "Лето 2025 ведет нас вперед, путь ясен.\n",
        "Цена 3990 рублей, промокод Sky777.\n",
        "Ветер шепчет: вперед, только вперед, FlyHigh.\n",
        "Таймер 0047, секунды бегут вперед.\n"
        ]
#print(text) 


#2. Создать файл message.txt
with open('message.txt', 'w') as f:
    for i in text:
        f.write(i)


#3. Созать список со строками из файла при помощи метода readlines()
with open('message.txt', 'r') as f:
    message_text = f.readlines()
# print(message_text) Проверка   
    
    
#4. Сделать пробел между исходным текстом и итоговым
with open('message.txt', 'a') as f:
    f.write("\n")


#5. Создать список для строк, прошедших шифрование
crypto_text = []


#6. Получить строку из списка message_text
for i in range(len(message_text)):
    line = message_text[i]
    crypto_line = ""
    
#7. Получить значение сдвига влево
    count = i + 1

#8. Получить символ из строки line
    for j in line:
        letter = j

#9. Проверить, что символ из кириллицы
        if ((1040 <= ord(letter)) and (ord(letter) <= 1103)):

#10. Проверить символ заглавный или строчный, сдвинуть его и присвоить в crypto_line
            # Для заглавных
            if ((1040 <= ord(letter)) and (ord(letter) <= 1071)):
                # Проверка надо или не надо переноситься в конец алфавита
                if (1040 <= ord(letter) - count):
                    crypto_line =  crypto_line + chr(ord(letter) - count)
                else:
                    crypto_line =  crypto_line + chr(1071 - (count - (ord(letter) - 1040) - 1))
           
           # Для строчных
            elif ((1072 <= ord(letter)) and (ord(letter) <= 1103)):
                if (1072 <= ord(letter) - count):
                    crypto_line =  crypto_line + chr(ord(letter) - count)
                else:
                    crypto_line =  crypto_line + chr(1103 - (count - (ord(letter) - 1072) - 1))
        else:
            crypto_line =  crypto_line + letter

#11. Присвоить получившуюся зашифрованную строку в список защифрованных строк
    crypto_text.append(crypto_line)               


# print(crypto_text) Проверка

with open('message.txt', 'a') as f:
    for i in crypto_text:
        f.write(i)

# choice = "w"
# while choice != "q":
    # choice = input("q для выхода ")
